In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv',nrows=6729)

In [3]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN

In [4]:
internet_df = pd.read_csv('../data/internet_use.csv',nrows=4495)

In [5]:
internet_df.head()

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN

In [6]:
internet_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4495 entries, 0 to 4494
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4495 non-null   object
 1   Year             4495 non-null   int64
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 140.6+ KB

In [7]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6729 entries, 0 to 6728
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6729 non-null   object
 1   Year             6729 non-null   int64
 2   Value            6729 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 210.4+ KB

In [8]:
gdp_df[-10:]

     Country or Area  Year        Value  Value Footnotes
6719        Zimbabwe  1999  3054.064189              NaN
6720        Zimbabwe  1998  3099.076182              NaN
6721        Zimbabwe  1997  3036.422224              NaN
6722        Zimbabwe  1996  2985.856605              NaN
6723        Zimbabwe  1995  2736.486436              NaN
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN
6728        Zimbabwe  1990  2819.549467              NaN

In [9]:
internet_df[-10:]

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [10]:
internet_df = internet_df.drop('Value Footnotes',1)

In [11]:
gdp_df = gdp_df.drop('Value Footnotes',1)

In [12]:
gdp_df = gdp_df.rename(columns={'Country or Area':'Country','Value':'GDP_Per_Capita'})

In [13]:
internet_df = internet_df.rename(columns={'Country or Area':'Country','Value':'Internet_Users_Pct'})

In [14]:
gdp_and_internet_use = pd.merge(gdp_df, internet_df, how='outer',on=['Country','Year'])
gdp_and_internet_use = gdp_and_internet_use.reset_index(drop=True)

In [15]:
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     1734.723214                 NaN
1  Afghanistan  2017     1758.465636                 NaN
2  Afghanistan  2016     1757.023490                 NaN
3  Afghanistan  2015     1766.593077                 NaN
4  Afghanistan  2014     1795.735834                6.39

In [16]:
gdp_and_internet_use[-5:]

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
7700  Virgin Islands (U.S.)  1997             NaN            6.948369
7701  Virgin Islands (U.S.)  1996             NaN            4.647186
7702  Virgin Islands (U.S.)  1995             NaN            2.801958
7703  Virgin Islands (U.S.)  1994             NaN            0.940645
7704  Virgin Islands (U.S.)  1990             NaN            0.000000

In [17]:
gdp_and_internet_use = gdp_and_internet_use[(gdp_and_internet_use['Year'].isin([2004,2009,2014]))]
gdp_and_internet_use = gdp_and_internet_use.reset_index(drop=True)

                   Country  Year  GDP_Per_Capita  Internet_Users_Pct
0              Afghanistan  2014     1795.735834            6.390000
1              Afghanistan  2009     1502.354073            3.550000
2              Afghanistan  2004     1025.208245            0.105809
3                  Albania  2014    10700.993216           60.100000
4                  Albania  2009     9525.377979           41.200000
..                     ...   ...             ...                 ...
830               Viet Nam  2009             NaN           26.550000
831               Viet Nam  2004             NaN            7.642409
832  Virgin Islands (U.S.)  2014             NaN           50.070000
833  Virgin Islands (U.S.)  2009             NaN           27.396510
834  Virgin Islands (U.S.)  2004             NaN           27.377009

[835 rows x 4 columns]

In [18]:
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2014     1795.735834            6.390000
1  Afghanistan  2009     1502.354073            3.550000
2  Afghanistan  2004     1025.208245            0.105809
3      Albania  2014    10700.993216           60.100000
4      Albania  2009     9525.377979           41.200000

In [20]:
gdp_internet_2004 = gdp_and_internet_use[gdp_and_internet_use.Year==2004]
gdp_internet_2009 = gdp_and_internet_use[gdp_and_internet_use.Year==2009]
gdp_internet_2014 = gdp_and_internet_use[gdp_and_internet_use.Year==2014]

In [21]:
print(gdp_internet_2004.head())
print(gdp_internet_2009.head())
print(gdp_internet_2014.head())

                Country  Year  GDP_Per_Capita  Internet_Users_Pct
2           Afghanistan  2004     1025.208245            0.105809
5               Albania  2004     7001.054082            2.420388
8               Algeria  2004    11845.170512            4.634475
11               Angola  2004     4604.657044            0.464815
14  Antigua and Barbuda  2004    21161.123532           24.266544
                Country  Year  GDP_Per_Capita  Internet_Users_Pct
1           Afghanistan  2009     1502.354073                3.55
4               Albania  2009     9525.377979               41.20
7               Algeria  2009    12697.690780               11.23
10               Angola  2009     6292.534856                6.00
13  Antigua and Barbuda  2009    22568.626530               42.00
                Country  Year  GDP_Per_Capita  Internet_Users_Pct
0           Afghanistan  2014     1795.735834                6.39
3               Albania  2014    10700.993216               60.10
6               Algeria  2014    13557.769757               18.09
9                Angola  2014     6813.052106               21.26
12  Antigua and Barbuda  2014    20440.540555               64.00

In [22]:
print(gdp_internet_2014['GDP_Per_Capita'].max())

130439.106673897